raw.js_output.txt
-----------------------
raw.js
-----------------------
Running 10s test @ http://localhost:3000
  8 threads and 1024 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    45.82ms   19.98ms 213.74ms   66.33%
    Req/Sec     1.46k   301.11     2.71k    80.50%
  116990 requests in 10.05s, 12.38MB read
  Socket errors: connect 0, read 963, write 0, timeout 0
Requests/sec:  11635.62
Transfer/sec:      1.23MB